---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.HostObject
source: html/d65bf83f-8b23-4fb9-162d-4baa143fd704.htm
---
# HostObject Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.